app/controllers/api/v1/authentication_controller.rb

      def signup
        user = User.new(user_params)

        if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "profile_picture") VALUES (?, ?, ?, ?, ?)  [["email", "dev@bspk.co.jp"], ["password_digest", "[FILTERED]"], ["created_at", "2023-08-04 03:59:49.740590"], ["updated_at", "2023-08-04 03:59:49.740590"], ["profile_picture", nil]]