app/controllers/api/v1/restaurants_controller.rb

              def create
                @restaurant = Restaurant.new(restaurant_params)

                if @restaurant.save
---
INSERT INTO "restaurants" ("name", "description", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "New Restaurant"], ["description", "A new restaurant description"], ["rating", 4], ["created_at", "2023-08-01 10:03:13.238515"], ["updated_at", "2023-08-01 10:03:13.238515"]]

              def update
                if @restaurant.update(restaurant_params)
---
UPDATE "restaurants" SET "name" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["name", "95 Diner"], ["updated_at", "2023-08-03 12:09:45.029880"], ["id", 7]]

              def destroy
                if @restaurant.destroy
---
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 6]]